### 책의 판다스
- 개인공부
- 사용한 데이터 파일: titanic.csv
- p.40

In [1]:
import pandas as pd

In [3]:
path = './data/titanic.csv'
titanic_df = pd.read_csv(path)
titanic_df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
print(f"DataFrame shape: {titanic_df.shape}")

DataFrame shape: (891, 15)

In [5]:
titanic_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 15 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   survived     891 non-null    int64
 1   pclass       891 non-null    int64
 2   sex          891 non-null    object
 3   age          714 non-null    float64
 4   sibsp        891 non-null    int64
 5   parch        891 non-null    int64
 6   fare         891 non-null    float64
 7   embarked     889 non-null    object
 8   class        891 non-null    object
 9   who          891 non-null    object
 10  adult_male   891 non-null    bool
 11  deck         203 non-null    object
 12  embark_town  889 non-null    object
 13  alive        891 non-null    object
 14  alone        891 non-null    bool
dtypes: bool(2), float64(2), int64(4), object(7)
memory usage: 92.4+ KB

In [7]:
titanic_df.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [8]:
value_count = titanic_df['pclass'].value_counts()
value_count

pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [9]:
titanic_pcalss = titanic_df['pclass']
print(type(titanic_pcalss))

<class 'pandas.core.series.Series'>

In [10]:
titanic_pcalss.head()

0    3
1    1
2    3
3    1
4    3
Name: pclass, dtype: int64

In [11]:
value_counts = titanic_pcalss.value_counts()
print(type(value_counts))
print(value_counts)

<class 'pandas.core.series.Series'>
pclass
3    491
1    216
2    184
Name: count, dtype: int64

In [12]:
print(f"titanic_df 데이터 건수: {titanic_df.shape[0]}")

print('기본 설정인 dropna=Ture로 value_counts()')
print(titanic_df['embarked'].value_counts())
print(titanic_df['embarked'].value_counts(dropna=False))

titanic_df 데이터 건수: 891
기본 설정인 dropna=Ture로 value_counts()
embarked
S    644
C    168
Q     77
Name: count, dtype: int64
embarked
S      644
C      168
Q       77
NaN      2
Name: count, dtype: int64

In [13]:
import numpy as np

In [14]:
# DataFrame과 리스트, 딕셔너리, 넘파이 ndarray 상호 변환

# 넘파이 ndarray, 리스트, 딕셔너리를 DataFrame으로 변환하기
col_name1 = ['col1']
list1 = [1, 2, 3]
array1 = np.array(list1)
print(f'array1 shape: {array1.shape}')

# 리스트를 이용해 DataFarme 생성
df_list1 = pd.DataFrame(list1, columns=col_name1)
print("1차원 리스트로 만든 DataFrame:", df_list1,sep='\n')

# 넘파이 ndarray를 이용해 DataFrame 생성
df_array1 = pd.DataFrame(array1, columns=col_name1)
print('1차원 ndarray로 만든 DataFram:', df_array1, sep='\n')

array1 shape: (3,)
1차원 리스트로 만든 DataFrame:
   col1
0     1
1     2
2     3
1차원 ndarray로 만든 DataFram:
   col1
0     1
1     2
2     3

In [15]:
col_name2 = ['col1', 'col2', 'col3']

# 2행x3열 형태의 리스트와 ndarray 생성한 뒤 이를 DataFrame으로 변환
list2 = [[1, 2, 3], [11, 12, 13]]
array2 = np.array(list2)
print(f"array2 shape: {array2.shape}")

df_list2 = pd.DataFrame(list2, columns=col_name2)
print('2차원 리스트로 만든 DataFrame', df_list2, sep='\n')

df_array2 = pd.DataFrame(array2, columns=col_name2)
print('2차원 ndarray로 만든 DataFrame', df_array2, sep='\n')

array2 shape: (2, 3)
2차원 리스트로 만든 DataFrame
   col1  col2  col3
0     1     2     3
1    11    12    13
2차원 ndarray로 만든 DataFrame
   col1  col2  col3
0     1     2     3
1    11    12    13

In [16]:
# key는 문자열 칼럼명으로 배핑, value는 리스트 형 (또는 ndarray) 칼럼 데이터로 매핑
dict_ = {'col1':[1, 11], 'col2':[2, 22], 'col3':[3, 33]}
df_dict = pd.DataFrame(dict_)
print('딕셔너리로 만든 DataFrame', df_dict, sep='\n')

딕셔너리로 만든 DataFrame
   col1  col2  col3
0     1     2     3
1    11    22    33

In [20]:
# DataFrame을 넘파이 ndarray, 리스트, 딕셔너리로 변환하기

# DataFrame to ndarray
array3 = df_dict.values
print(f"df_dict.valus type: {type(array3)}, df_dict.values shape: {array3.shape}")
print(array3)

# DataFrame to list
list3 = df_dict.values.tolist()
print(f"df_dict.value.tolist() type: {type(list3)}")
print(list3)

# DataFrame to dict
dict3 = df_dict.to_dict()
print(f"df_dict.to_dict() type: {type(dict3)}")
print(dict3)

df_dict.valus type: <class 'numpy.ndarray'>, df_dict.values shape: (2, 3)
[[ 1  2  3]
 [11 22 33]]
df_dict.value.tolist() type: <class 'list'>
[[1, 2, 3], [11, 22, 33]]
df_dict.to_dict() type: <class 'dict'>
{'col1': {0: 1, 1: 11}, 'col2': {0: 2, 1: 22}, 'col3': {0: 3, 1: 33}}

In [22]:
# 알고있는 파트는 빠르게 넘김, skip
# apply lambda 식으로 데이터 가공

# lambda
a = [1, 2, 3]
squares = map(lambda x: x**2, a)
print(list(squares))

[1, 4, 9]

In [24]:
# titanic_df에 적용
titanic_df['Child_Adult'] = titanic_df['age'].apply(lambda x: 'Child' if x <= 15 else 'Adult')
titanic_df[['age', 'Child_Adult']].head()

    age Child_Adult
0  22.0       Adult
1  38.0       Adult
2  26.0       Adult
3  35.0       Adult
4  35.0       Adult

In [25]:
titanic_df['Age_cat'] = titanic_df['age'].apply(lambda x: 'Child' if x <= 15 else ('Adult' if x <=60 else 'Elderly'))
titanic_df['Age_cat'].value_counts()

Age_cat
Adult      609
Elderly    199
Child       83
Name: count, dtype: int64

In [26]:
# 나이에 따라 세분화된 분류를 수행하는 함수
def get_category(age):
    cat=''
    
    if age <= 5: cat = 'Baby'
    elif age <= 12: cat = 'Child'
    elif age <= 18: cat = 'Teenager'
    elif age <= 25: cat = 'Student'
    elif age <= 35: cat = 'Young Adult'
    elif age <= 60: cat = 'Adult'
    else: cat = 'Elderly'
    
    return cat

In [27]:
titanic_df['Age_cat'] = titanic_df['age'].apply(lambda x: get_category(x))
titanic_df[['age', 'Age_cat']].head()

    age      Age_cat
0  22.0      Student
1  38.0        Adult
2  26.0  Young Adult
3  35.0  Young Adult
4  35.0  Young Adult